{"kol_contactUs":"Contact us","kol_subTitle1":"KOL and KOC Marketing in China","kol_subTitle1_text1":"KOL marketing is able to effectively increase brand awareness, and establish a positive relationship with the customer by building a connection. Their huge fan base and fiercely loyal followers also have the ability to make things viral for a promoting product to become a trending product. KOC marketing is becoming more crucial as Chinese consumers are increasingly sensitive to authenticity, and sometimes get more value for money than KOL marketing. KOC creates authenticity and opportunity for engagement with customers directly to convert passive followers into active consumers when they provide their heartfelt reviews and opinions.","kol_subTitle1_text1_subtopic1":"KOL (Key Opinion Leader)","kol_subTitle1_text1_subtopic1_content":"KOL (Key Opinion Leader) is a spokesperson, a brand ambassador, or more commonly known as an “Influencer”. They have a significant presence with established credibility in the social media industry due to their large amount of followers.","kol_subTitle1_text1_subtopic2":"KOC (Key Opinion consumers)","kol_subTitle1_text1_subtopic2_content":" KOC (Key Opinion consumers) are the micro-influencers of China. The benefits of collaborating with KOCs on Chinese social media, especially Little Red Book, is that they are more authentic, they are more loyal to a brand, and much less expensive.","kol_subTitle2":"How GEMedia Can Support You?","kol_text2":"GEMedia will develop a comprehensive KOLs & KOCs seeding strategy catered to your brand’s objective, needs, target audience, and budget to maximise brand recognition and credibility. We identify the right KOLs and KOCs for your brand and create a talent matrix to build your brand awareness, promote your products or services, and stimulate your month of advertisement on Chinese social media. Different social media platforms usually have different focuses, we will customise the seeding strategy based on our client’s position.","kol_text2_subTopic1":"Little Red Book","kol_text2_subTopic1_content1":"Little Red Book (LRB) is one of China's top social media platforms with 200 million monthly active users. Regardless of whether your brand has an official account or a shop on this platform, it is still wise to work with KOLs and KOCs to generate word-of-mouth branding here.","kol_text2_subTopic1_content2":"For brands, one of the biggest challenges is getting their potential audience to know about, try, and then recommend their products. The GEMedia team is highly experienced in KOC and KOL marketing on the Little Red Book. Our team is always capable of identifying appropriate LRB users based on their content and audience for our clients.","kol_text2_subTopic1_content3":"Most importantly, we align with the platform's values: whenever we work with influencers, we always aim to engage them to share real product reviews instead of creating fake advertisements. Chinese customers are sensitive to authenticity, so if someone claims to be able to help you target a pool of users and you do not need to provide any products, please turn them down. Massive fake posts may increase the number of brand posts in a short time, but will damage your brand's image, and you will lose potential customers in a long run. By working effectively with LRB influencers, GEMedia has been helping our clients successfully create brand awareness, establish positive brand presences and enhance reliable word-of-mouth promotions.","kol_text2_subTopic2":"WeChat","kol_text2_subTopic2_content1":"Western social media platforms like Instagram tend to focus on visual content. Influencers on WeChat, however, are usually expected to write long, informative articles with images, videos, GIFs, or audio clips to keep their readers engaged.","kol_text2_subTopic2_content2":"Your brand's KOL marketing on WeChat will help you to increase audience engagement and maximize WeChat SEO to enhance your brand and product visibility.","kol_text2_subTopic2_content3":"GEMedia is able to assist our clients in filtering KOLs and selecting appropriate influencers from a variety of categories. Furthermore, we will work with KOLs to create content. As well as enabling influencers to have maximum flexibility, we also assist with the optimization of articles.","kol_text2_subTopic3":"Douyin","kol_text2_subTopic3_content1":"Douyin is the Chinese alternative version of TikTok, a worldwide popular social media platform. With over 700 million daily active users, Douyin social media marketing can help brands to increase their web traffic and customer engagement.","kol_text2_subTopic3_content2":"The Douyin traffic flow is algorithm-driven that ensures the ideal viewers are its audience according to their interests, demand, and purchase. GEMedia will identify and source your ideal KOL to formulate a talent matrix that aligns with your brand positioning to assist your brand in attracting more potential customers and stimulating more sales.","kol_title":"KOCs & KOLs Marketing"}